import React from "react";

const ArticlesContentDetails = () => {
  // Sample list of articles with detailed descriptions
  const articles = [
    {
      id: 1,
      title: "المقالة الأولى",
      details:
        "تعتبر النصائح الدراسية جزءًا أساسيًا من نجاح الطلاب في مسيرتهم الأكاديمية. تشمل هذه النصائح كيفية تنظيم الوقت بشكل فعال، وأهمية وضع أهداف دراسية واضحة، وكيفية إدارة الضغوط النفسية خلال فترة الامتحانات. كما أن التعلم النشط والمشاركة الفعالة في الدروس يسهمان بشكل كبير في تحسين الأداء الأكاديمي.",
    },
    {
      id: 2,
      title: "المقالة الثانية",
      details:
        "تحسين مهارات الكتابة يتطلب ممارسة مستمرة وتوجيه مناسب. يجب على الطلاب التركيز على تطوير أساليب الكتابة الأكاديمية، وتعلم كيفية صياغة الأفكار بشكل منطقي. من الضروري أيضًا فهم كيفية استخدام المصادر بشكل صحيح وتجنب الانتحال، بالإضافة إلى تحسين قواعد اللغة والنحو لتقديم محتوى مكتوب بشكل احترافي.",
    },
    {
      id: 3,
      title: "المقالة الثالثة",
      details:
        "تحفيز الطلاب يمكن تحقيقه من خلال استراتيجيات متنوعة تشمل تقديم مكافآت لتحسين الأداء، وتوفير بيئة تعليمية مشجعة. يمكن للمعلمين استخدام الأنشطة التفاعلية والمشاريع الجماعية لجعل التعلم أكثر جاذبية. كما أن دعم الطلاب بطرق فردية ومراقبة تقدمهم بشكل منتظم يمكن أن يعزز دافعهم للتعلم.",
    },
    {
      id: 4,
      title: "المقالة الرابعة",
      details:
        "اختيار التخصص الأكاديمي يتطلب التفكير العميق في اهتمامات الطالب ومهاراته المستقبلية. يجب على الطلاب استكشاف الخيارات المتاحة ومقارنة بين التخصصات المختلفة بناءً على فرص العمل المستقبلية ومتطلبات الدراسة. التحدث مع المستشارين الأكاديميين وأخذ المشورة من الأشخاص ذوي الخبرة يمكن أن يساعد في اتخاذ القرار المناسب.",
    },
    {
      id: 5,
      title: "المقالة الخامسة",
      details:
        "تحسين التفاعل بين الطلاب والمعلمين يشمل استخدام أساليب التواصل الفعالة وتعزيز الحوار البناء. يمكن تحقيق ذلك من خلال استخدام تقنيات التدريس الحديثة وتوفير بيئة تعليمية تشجع على المشاركة. من المهم أيضًا أن يستمع المعلمون إلى ملاحظات الطلاب ويتعاملوا مع أي تحديات تواجههم بشكل سريع وفعال.",
    },
  ];

  return (
    <div
      className="flex flex-col items-center justify-center p-4"
      lang="ar"
      dir="rtl"
    >
      {/* Container for Articles */}{" "}
      <div className="max-w-6xl w-full p-8">
        {" "}
        {articles.map((article) => (
          <div key={article.id} className="mb-12">
            <h1 className=" text-2xl font-bold mb-2 text-[#63518C]">
              {" "}
              {article.id}. {article.title}{" "}
            </h1>{" "}
            <p className="text-lg text-gray-700"> {article.details} </p>{" "}
          </div>
        ))}{" "}
      </div>{" "}
    </div>
  );
};

export default ArticlesContentDetails;
